In [3]:
import pandas as pd

In [25]:
customer_data=pd.read_csv('Customers.csv',encoding='ISO-8859-1')
sales_data=pd.read_csv("Sales.csv")
product_data=pd.read_csv("Products.csv")
store_data=pd.read_csv("Stores.csv")
exchange_rates_data=pd.read_csv("Exchange_Rates.csv")

CUSTOMER_DATA

In [26]:
customer_data.head(5)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7-3-39
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9-27-79
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5-26-47
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9-17-57
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11-19-65

In [18]:
customer_data.duplicated().sum()

np.int64(0)

In [27]:
def null_value_imputer(df):
    for i in df.columns:
        if (df[i].isnull().sum()/len(df))*100>=75:
            df.drop(i,axis=1,inplace=True)
        elif df[i].dtypes in ["int64", "float64"]:
            if df[i].skew()< 0.4 and df[i].skew()>-0.4:
                df[i].fillna(df[i].mean(),inplace=True)
            else:
                df[i].fillna(df[i].median(),inplace=True)
        else:
            df[i].fillna(df[i].mode()[0],inplace=True)
    print(df.isnull().sum())

In [28]:
customer_data.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [29]:
customer_data.shape

(15266, 10)

In [30]:
null_value_imputer(customer_data)

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

C:\Users\nsjag\AppData\Local\Temp/ipykernel_27768/615888334.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mean(),inplace=True)
C:\Users\nsjag\AppData\Local\Temp/ipykernel_27768/615888334.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mode()[0],inplace=True)

In [31]:
customer_data.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [32]:
customer_data

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7-3-39
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9-27-79
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5-26-47
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9-17-57
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11-19-65
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,3-25-36
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,2-16-92
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,11-9-37
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,10-12-37
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,8-18-65

In [33]:
customer_data["day"]=pd.to_datetime(customer_data["Birthday"]).dt.day

C:\Users\nsjag\AppData\Local\Temp/ipykernel_27768/4109313828.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  customer_data["day"]=pd.to_datetime(customer_data["Birthday"]).dt.day

In [38]:
customer_data["month"]=pd.to_datetime(customer_data["Birthday"]).dt.month_bame()

C:\Users\nsjag\AppData\Local\Temp/ipykernel_27768/2857749414.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  customer_data["month"]=pd.to_datetime(customer_data["Birthday"]).dt.month_bame()

AttributeError: 'DatetimeProperties' object has no attribute 'month_bame'

In [35]:
customer_data

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,day,month
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7-3-39,3,7
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9-27-79,27,9
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5-26-47,26,5
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9-17-57,17,9
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11-19-65,19,11
...,...,...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,3-25-36,25,3
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,2-16-92,16,2
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,11-9-37,9,11
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,10-12-37,12,10
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,8-18-65,18,8

In [16]:
customer_data.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
day             int32
month           int32
dtype: object

In [17]:
customer_data.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,day,month
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7-3-39,3,7
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9-27-79,27,9
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5-26-47,26,5
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9-17-57,17,9
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11-19-65,19,11

In [18]:
customer_data.drop("Birthday",axis=1,inplace=True)

In [19]:
customer_data["month"].unique()

array([ 7,  9,  5, 11,  1,  3, 12,  8, 10,  4,  2,  6], dtype=int32)

In [20]:
customer_data["month_name"]=customer_data["month"].map({1:"January",2:"Febraury",3:"March",4:"April",5:"May",6:"June",
                                                        7:"July",8:"August",9:"September",10:"October",11:"November",12:"December"})

In [21]:
customer_data.head(3)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,day,month,month_name
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,3,7,July
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,27,9,September
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,26,5,May

In [22]:
customer_data.to_csv("Customerdata.csv",index=False)

# SALES_DATA

In [23]:
sales_data.head(5)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [24]:
sales_data.duplicated().sum()

np.int64(0)

In [25]:
sales_data.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [26]:
sales_data.shape

(62884, 9)

In [27]:
sales_data.drop("Delivery Date",inplace=True,axis=1)

In [28]:
sales_data.head(5)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,266019,0,373,1,CAD

In [29]:
sales_data.isnull().sum()

Order Number     0
Line Item        0
Order Date       0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [30]:
sales_data["Order Date"]=pd.to_datetime(sales_data["Order Date"])

In [31]:
sales_data.dtypes

Order Number              int64
Line Item                 int64
Order Date       datetime64[ns]
CustomerKey               int64
StoreKey                  int64
ProductKey                int64
Quantity                  int64
Currency Code            object
dtype: object

In [32]:
sales_data.head(3)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD
2,366001,2,2016-01-01,1269051,0,2007,1,USD

In [33]:
sales_data.to_csv("Salesdata.csv",index=False)

# PRODUCT_DATA

In [4]:
product_data.head(5)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [5]:
product_data.duplicated().sum()

np.int64(0)

In [6]:
product_data.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [13]:
product_data["Unit Cost USD"]=product_data["Unit Cost USD"].str.replace("$","").str.replace(",","")
product_data["Unit Price USD"]=product_data["Unit Price USD"].str.replace("$","").str.replace(",","")
product_data["UnitCostUSD"]=pd.to_numeric(product_data["Unit Cost USD"])
product_data["UnitPriceUSD"]=pd.to_numeric(product_data["Unit Price USD"])

KeyError: 'Unit Cost USD'

In [8]:
product_data.drop(["Unit Cost USD","Unit Price USD"],axis=1,inplace=True)

In [14]:
product_data.head(5)

,ProductKey,Product Name,Brand,Color,SubcategoryKey,Subcategory,CategoryKey,Category,UnitCostUSD,UnitPriceUSD
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,101,MP4&MP3,1,Audio,6.62,12.99
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,101,MP4&MP3,1,Audio,6.62,12.99
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,101,MP4&MP3,1,Audio,7.40,14.52
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,101,MP4&MP3,1,Audio,11.00,21.57
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,101,MP4&MP3,1,Audio,11.00,21.57

In [10]:
product_data.dtypes

ProductKey          int64
Product Name       object
Brand              object
Color              object
SubcategoryKey      int64
Subcategory        object
CategoryKey         int64
Category           object
UnitCostUSD       float64
UnitPriceUSD      float64
dtype: object

In [11]:
product_data.to_csv("NewProductdata.csv",index=False)

# STORE_DATA

In [42]:
store_data.head(5)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [43]:
store_data.duplicated().sum()

np.int64(0)

In [44]:
store_data.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [45]:
store_data.shape

(67, 5)

In [46]:
null_value_imputer(store_data)

StoreKey         0
Country          0
State            0
Square Meters    0
Open Date        0
dtype: int64

C:\Users\nsjag\AppData\Local\Temp/ipykernel_19700/615888334.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mean(),inplace=True)
C:\Users\nsjag\AppData\Local\Temp/ipykernel_19700/615888334.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mode()[0],inplace=True)
C:\Users\nsjag\AppData\Local\Temp/ipykernel_19700/615888334.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].median(),inplace=True)
C:\Users\nsjag\AppData\Local\Temp/ipykernel_19700/615888334.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mode()[0],inplace=True)

In [47]:
store_data.dtypes

StoreKey           int64
Country           object
State             object
Square Meters    float64
Open Date         object
dtype: object

In [48]:
store_data["OpenDate"]=pd.to_datetime(store_data["Open Date"])

In [49]:
store_data.head(3)

,StoreKey,Country,State,Square Meters,Open Date,OpenDate
0,1,Australia,Australian Capital Territory,595.0,1/1/2008,2008-01-01
1,2,Australia,Northern Territory,665.0,1/12/2008,2008-01-12
2,3,Australia,South Australia,2000.0,1/7/2012,2012-01-07

In [50]:
store_data.drop("Open Date",inplace=True,axis=1)

In [51]:
store_data.head(3)

   StoreKey    Country                         State  Square Meters   OpenDate
0         1  Australia  Australian Capital Territory          595.0 2008-01-01
1         2  Australia            Northern Territory          665.0 2008-01-12
2         3  Australia               South Australia         2000.0 2012-01-07

In [52]:
store_data.to_csv("Storedata.csv",index=False)

# Exchange_Rates_Data

In [53]:
exchange_rates_data.head(5)

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [54]:
exchange_rates_data.shape

(11215, 3)

In [55]:
exchange_rates_data.duplicated().sum()

np.int64(0)

In [56]:
exchange_rates_data.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [57]:
exchange_rates_data["Date"]=pd.to_datetime(exchange_rates_data["Date"])

In [58]:
exchange_rates_data.dtypes

Date        datetime64[ns]
Currency            object
Exchange           float64
dtype: object

In [59]:
exchange_rates_data.to_csv("Exchangeratedata.csv",index=False)

# PYMYSQL-CONNECT

In [18]:
import pymysql
import pandas as pd

In [62]:
#"Exchangeratedata.csv","Storedata.csv","Productdata.csv","Salesdata.csv","Customerdata.csv"

In [16]:
df1=pd.read_csv("Customerdata.csv")
df2=pd.read_csv("Salesdata.csv")
df3=pd.read_csv("NewProductdata.csv")
df4=pd.read_csv("Storedata.csv")
df5=pd.read_csv("Exchangeratedata.csv")

In [19]:
myconnection = pymysql.connect(host='127.0.0.1',user='root',passwd='1441')

In [67]:
myconnection.cursor().execute("create database Globalelectronics")

1

In [20]:
myconnection.cursor().execute(" use Globalelectronics ")

0

In [69]:
a=",".join(f"{i} {j}"
for i,j in zip(df1.columns,df1.dtypes)).replace("float64","float").replace("int64","int").replace("object","VARCHAR(200)")

In [71]:
f"create table IF NOT EXISTS customerdata({a})"

'create table IF NOT EXISTS customerdata(CustomerKey int,Gender VARCHAR(200),Name VARCHAR(200),City VARCHAR(200),State Code VARCHAR(200),State VARCHAR(200),Zip Code VARCHAR(200),Country VARCHAR(200),Continent VARCHAR(200),day int,month int,month_name VARCHAR(200))'

In [72]:
myconnection.cursor().execute("""create table IF NOT EXISTS customerdata(CustomerKey int,
                              Gender VARCHAR(200)
                              ,Name VARCHAR(200)
                              ,City VARCHAR(200)
                              ,StateCode VARCHAR(200)
                              ,State VARCHAR(200),
                              ZipCode VARCHAR(200)
                              ,Country VARCHAR(200)
                              ,Continent VARCHAR(200)
                              ,day int
                              ,month int
                              ,month_name VARCHAR(200))""")

0

In [75]:
insert_query= """ INSERT INTO customerdata(CustomerKey, Gender, Name, City,StateCode, State,
       ZipCode, Country, Continent, day,month,month_name) VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"""

In [78]:
  # row['CustomerKey'],row['Gender'],row['Name'],row['City'],row['StateCode'],row['State'],row['ZipCode'] row['Country'],row['Continent'], row['day'],  row['month'],row['month_name']))

In [76]:
for index,row in df1.iterrows():
    myconnection.cursor().execute(insert_query,(row['CustomerKey'],row['Gender'],row['Name'],row['City'],row['State Code'],row['State'],
                                                 row['Zip Code'],row['Country'],row['Continent'],row['day'],row['month'],row['month_name']))

In [77]:
myconnection.commit()

In [79]:
b=",".join(f"{i} {j}"
for i,j in zip(df2.columns,df2.dtypes)).replace("float64","float").replace("int64","int").replace("object","VARCHAR(200)")

In [80]:
f"create table IF NOT EXISTS salesdata({b})"

'create table IF NOT EXISTS salesdata(Order Number int,Line Item int,Order Date VARCHAR(200),CustomerKey int,StoreKey int,ProductKey int,Quantity int,Currency Code VARCHAR(200))'

In [82]:
myconnection.cursor().execute("""create table IF NOT EXISTS salesdata(OrderNumber int,
                                                                      LineItem int,
                                                                      OrderDate VARCHAR(200),
                                                                      CustomerKey int,
                                                                      StoreKey int,
                                                                      ProductKey int,
                                                                      Quantity int,
                                                                      CurrencyCode VARCHAR(200))""")

0

In [83]:
insert_query1= """ INSERT INTO salesdata(OrderNumber,LineItem,OrderDate,CustomerKey,StoreKey,ProductKey,Quantity,CurrencyCode) VALUES(%s,%s,%s,%s,%s,%s,%s,%s)"""

In [84]:
for index,row in df2.iterrows():
    myconnection.cursor().execute(insert_query1,(row['Order Number'],row['Line Item'],row['Order Date'],row['CustomerKey'],row['StoreKey'],row['ProductKey'],
                                                 row['Quantity'],row['Currency Code']))

In [85]:
myconnection.commit()

In [21]:
c=",".join(f"{i} {j}"
for i,j in zip(df3.columns,df3.dtypes)).replace("float64","float").replace("int64","int").replace("object","VARCHAR(200)")

In [22]:
f"create table IF NOT EXISTS productdata({c})"

'create table IF NOT EXISTS productdata(ProductKey int,Product Name VARCHAR(200),Brand VARCHAR(200),Color VARCHAR(200),SubcategoryKey int,Subcategory VARCHAR(200),CategoryKey int,Category VARCHAR(200),UnitCostUSD float,UnitPriceUSD float)'

In [24]:
myconnection.cursor().execute("""create table IF NOT EXISTS Newproductdata(ProductKey int,
                                                                        ProductName VARCHAR(200),
                                                                        Brand VARCHAR(200),
                                                                        Color VARCHAR(200),
                                                                        UnitCostUSD VARCHAR(200),
                                                                        UnitPriceUSD VARCHAR(200),
                                                                        SubcategoryKey int,
                                                                        Subcategory VARCHAR(200),
                                                                        CategoryKey int,
                                                                        Category VARCHAR(200))""")

0

In [25]:
insert_query2= """ INSERT INTO Newproductdata(ProductKey,ProductName,Brand,Color,UnitCostUSD,UnitPriceUSD,SubcategoryKey,Subcategory,CategoryKey,Category)VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"""

In [26]:
for index,row in df3.iterrows():
    myconnection.cursor().execute(insert_query2,(row['ProductKey'],row['Product Name'],row['Brand'],row['Color'],row['UnitCostUSD'],
                                                 row['UnitPriceUSD'],row['SubcategoryKey'],row['Subcategory'],row['CategoryKey'],row['Category']))

In [27]:
myconnection.commit()

In [93]:
d=",".join(f"{i} {j}"
for i,j in zip(df4.columns,df4.dtypes)).replace("float64","float").replace("int64","int").replace("object","VARCHAR(200)")

In [94]:
f"create table IF NOT EXISTS storedata({d})"

'create table IF NOT EXISTS storedata(StoreKey int,Country VARCHAR(200),State VARCHAR(200),Square Meters float,OpenDate VARCHAR(200))'

In [97]:
myconnection.cursor().execute("""create table IF NOT EXISTS storedata(StoreKey int,
                                                                      Country VARCHAR(200),
                                                                      State VARCHAR(200),
                                                                      SquareMeters float,
                                                                      OpenDate VARCHAR(200))""")

0

In [98]:
insert_query3= """ INSERT INTO storedata(StoreKey,Country,State,SquareMeters,OpenDate)VALUES(%s,%s,%s,%s,%s)"""

In [99]:
for index,row in df4.iterrows():
    myconnection.cursor().execute(insert_query3,(row['StoreKey'],row['Country'],row['State'],row['Square Meters'],row['OpenDate']))

In [100]:
myconnection.commit()

In [101]:
e=",".join(f"{i} {j}"
for i,j in zip(df5.columns,df5.dtypes)).replace("float64","float").replace("int64","int").replace("object","VARCHAR(200)")

In [102]:
f"create table IF NOT EXISTS exchange_rates({e})"

'create table IF NOT EXISTS exchange_rates(Date VARCHAR(200),Currency VARCHAR(200),Exchange float)'

In [103]:
myconnection.cursor().execute("""create table IF NOT EXISTS exchange_rates(Date VARCHAR(200),
                                                                           Currency VARCHAR(200),
                                                                           Exchange float)""")

0

In [104]:
insert_query4= """INSERT INTO exchange_rates(Date,Currency,Exchange)VALUES(%s,%s,%s)"""

In [105]:
for index,row in df5.iterrows():
    myconnection.cursor().execute(insert_query4,(row['Date'],row['Currency'],row['Exchange']))

In [106]:
myconnection.commit()